{"allCellModel":[{
 "cellModelType":2,
 "articles": {
 "headPortrait":"222",
 "userName":"入江之鲸",
 "time":"昨天",
 "article":"我想告诉你我为什么爱钱",
 "special":"签约作者",
 "reading":"8113",
 "comments":"202",
 "likes":"595",
 "articleImage":"222",
 "articleText":"<image name=http://upload-images.jianshu.io/upload_images/1374926-4a47dbb4c820ede2.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240/>\n1.\n\n前几天，在微博热搜上看到了这样一条新闻：一位63岁的老母亲，因为儿子患病无钱医治，竟然跳楼自杀，想用她的死，换保险公司的30万意外险赔偿，为儿子治病。\n\n她永远也不会知道了，自杀是不能获得意外险赔偿的，而且那份保险，去年已经过期了。\n\n儿子在讲到他看到母亲掉下去的时候，有泪不轻弹的铮铮男儿，眼泪止不住地往下掉。\n\n这样的悲剧，让人心痛。\n\n某富二代在酒吧一晚上就消费二十万，可是贫穷又愚昧的老母亲，却不得不用命去换三十万的医疗费。贫穷，就是这样把人逼上绝路的。\n\n2.\n\n大三了，暑期实习，身边同学都在申北上广的实习，可以获得一纸好看的实习证明。\n\n在省会985念书的她，也很想去大城市看看，可还是选择留在了本地实习。原因很简单：她负担不起北上广高昂的房租。连实习的区区三个月，她都负担不起。\n\n她想读研究生，以她的成绩保研不在话下。只是回家的时候，爸妈哀叹，生意越来越不好做，生猪价格一直在涨，起大早卖猪肉，一天只能赚一百来块钱。\n\n小时候，有一次妈妈病了，一闻到猪圈的味道就会吐，于是每天天还没亮，她就被爸爸叫起来帮手干活。别人都说她懂事，她只是在心里想，真的好困啊……而爸妈，每一天都要那样辛苦、那样劳累。\n\n她的父母，一直指望着她大学毕业了，可以供弟弟上大学，他们老两口劳苦了一辈子，干不动活了。\n\n外语专业的她，怎么会没有偷偷幻想过出国梦？可是因为家庭条件的限制，这些华丽美好的梦想连说出口的机会都没有，就被自己悄悄地咽下了。\n\n有一句话说，“当一个人的梦想超越他的家庭的时候，我们没有资格去要求父母什么”。确实如此，可是看到你这么懂事，我真的好心疼啊。\n\n\n3.\n\n被查出问题来，是在一家小医院，医生很冷静地对他说：“你这病治不好了。”医生面无表情，他难以置信。\n\n因为不敢相信，他选择去大医院复诊。\n\n化验费用太高昂，成百上千地扣。悬而未决的病情、银行卡上刷刷少掉的数字，这都是孤身一人在大城市打拼的他，需要独自消化掉的绝望。\n\n也不知该是悲还是喜，几次化验下来，都没查出太大异常，医生又刷刷开了单子化验别的项目。拿到缴费单的那一刻，他心里是重若千钧的绝望。\n\n又是上千块，而那时候，他已经身无分文了。\n\n他从医生那里出来，默默地找到导诊的护士，请她帮忙把化验的项目取消掉。护士一脸不解地问：“为什么不化验了？”他抿着唇，一句话也说不出。\n\n他心一横，哪怕有病，他也要放弃治疗了。\n\n他在手机上看到这样一句话：因为穷，所以不敢病、不敢死。\n\n离开了人山人海的医院，在偌大城市的地铁上，他没忍住，兀自留下了眼泪。\n\n4.\n\n——她啊，被老板炒鱿鱼之后，拿着300块走在大马路上，舍不得坐车，一边哭一边想着晚上去哪里吃最便宜的晚餐。\n\n她需要一天打两份工，婚后不小心怀孕，生活拮据，为了省下几百块钱，没有选择无痛人流，选择了去药流。孩子怎么都下不来，医生让她在医院的楼梯上跑上跑下，最后也没有流掉，直接做了清宫。\n\n——他啊，以前以为，钱够用就好。直到有一天，他的母亲被查出癌症，住院一天要一千多。家里没有钱，他平常打工、周末兼职，想方设法地赚钱，还没筹够钱给妈妈看病，妈妈已经走了。\n\n——她啊，小学从来没有上过早读，因为要洗衣服、要放牛。每次到学校，都是别的孩子早读结束的时候。放学后，她还要放牛打猪草，回来后还要带弟弟妹妹，洗澡洗脸。\n\n农忙的时候，要请假回家干农活。因为家里只有爷爷奶奶，十几亩地的庄稼他们弄不回来就只能烂在地里，那是在割他们的肉啊。\n\n很多人爱看流星，凌晨干农活的时候她经常看到，却不觉得美、只有困倦疲累。\n\n——他的外公啊，一身病痛、没钱治疗，所以选择喝下老鼠药，结束自己的生命。喝完药后，外公呕吐起来。外婆舍不得花钱带外公去大医院洗胃，天真地以为吐了就会好起来了。\n\n第二天的早上，外公去世了。\n\n\n5.\n\n当你经济宽裕的时候，别总觉得那些贫穷的人寒酸，看不起他们爱钱如命。对他们来说，钱就是命，有钱才能活命啊。\n\n这世上有多少爱钱的人，是因为穷怕了。他们背后，各藏着不为人知的故事。\n\n太多最苦最难的日子，都只是因为没有钱。\n\n因为贫穷，就连轻如鸿毛的小病小灾，都能轻易地将一个人击垮。\n\n为什么爱钱？因为想要有学可上，有病能看，有梦想的时候可以勇敢去追。因为不想因为贫贱被别人小瞧，不想因为钱而离开谁放弃什么，不想眼睁睁看着亲人因为看不起病而忍着，不想让自己的孩子小小年纪就懂事地学会雪藏梦想。\n\n很多时候，我们就是这样真实而无奈地爱着钱啊。"
 },
 "specials":"",
 "defaults":""
},
 {
 "cellModelType":2,
 "articles": {
 "headPortrait":"222",
 "userName":"那年的夏 ",
 "time":"6小时",
 "article":"我在鹅厂做“码农”",
 "special":"作者",
 "reading":"2625",
 "comments":"22",
 "likes":"67",
 "articleImage":"222",
 "articleText":"\r\n上周一直在鹅厂QQ浏览器产品部研发岗写代码，基本天天写到凌晨一两点，终于熬到周末才拿出时间写写这周在鹅厂做码农的体验，今天就给大家分享一下目前鹅厂使用的开发流程和产品经理如何与程序员更好相处的思考。\n<image name=http://upload-images.jianshu.io/upload_images/697823-13b7d1cc172772e0.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240/>\n\n鹅厂很多开发团队使用的开发流程都是敏捷开发，比如像QQ浏览器目前在用的就是Scrum敏捷开发，那什么是Srum开发呢？\n\n\n\n\n敏捷开发\n\n以用户需求进化为核心，采用迭代、循序渐进方法进行软件开发\n\n1）个体和交互胜过过程和工具\n\n2）可以工作的软件胜过面面俱到的文档\n\n3）响应变化胜过遵循计划\n\n包括3个角色：\n\n产品负责人（Product Owner）\n\nScrum Master\n\nScrum团队\n\n3个工件：\n\n产品Backlog（Product Backlog）\n\nSprintBacklog\n\n燃尽图（Burn-down Chart)\n\n5个活动：\n\nSprint计划会议（Sprint Planning Meeting）\n\n每日站会（Daily Scrum Meeting）\n\nSprint评审会议（Sprint Review Meeting）\n\nSprint回顾会议（Sprint Retrospective Meeting）\n\n产品Backlog梳理会议（Product Backlog Refinement）\n\n除了敏捷开发，目前常用的项目开发流程是下面的顺序哦：\n\n项目开发流程\n\n1.需求评审\n\n1.想清楚需求\n\n准备好文件（竞品分析、需求分析、数据分析、交互稿、UI稿、其他关键步骤的准备情况）——根据需求清空选择性准备\n\n2.拉齐关键人\n\n预定时间、人员、场地\n\n3.开始评审\n\n（简要阐述需求背景、目的，说明自己的倾向和原因，与大家达成共识）\n\n4.评审结束后\n\n及时跟踪修改点，缺点终稿需求，需求变化需要走严格的需求变更流程\n\n最后在需求评审前可以和关键人先进行内部沟通，可以减少评审时间\n\n评审结束后，要发邮件同步所有关键人。\n\n2.测试用例评审\n\n迭代开发周期内：\n\n产品设计工作\n\n1.跟踪开发进度，积极体验完成的功能\n\n2.尽量用邮件及时滚动产品需求变更文档（通知所有关键人）\n\n3.功能完成后做好验收报告\n\n3.迭代测试周期\n\n产品设计的工作\n\n1.留意测试发现的问题\n\n2.留意测试进度\n\n3.协调资源进行测试\n\n4.集成测试周期（把各个小功能集合在一起）\n\n注意：\n\n1.此阶段原则上不允许需求变更\n\n2.提交大量代码时要报备项目经理和测试（以下是开发要注意）\n\n3.提交代码需要衡量是否进行CodeReview\n\n5.回归测试\n\n修改旧代码后，重新进行测试以确认修改没有引入新的问题或导致其他代码产生错误\n\n6.上线前测试\n\n1.保证发布版本审核通过\n\n2.保证发布版本可用\n\n3.保证资源足够\n\n7.灰度发布\n\n作用：及早获得用户意见反馈，完善产品功能\n\n灰度发布能降低发布出问题的影响\n\n要注意观察灰度中产品埋入的数据反馈是否正常（产品经理需要注意的）\n\n8.正式发布时\n\n产品设计：跟踪用户反馈问题，准备下个版本需求\n\n总结大会，总结问题\n\n除了以上的开发流程之外，在这周写代码的过程中对于开发的工作有了一些新的认识也分享给大家：\n\n1.开发工作确实不容易\n\n这周的导师要求我们在五天内做出一款计算器App,同时又要求有两个使用场景，这对于我们基本四个没有安卓的开发经验的小组成员来说似乎算是一个不太可能完成的任务，但是大家还是尽快分工，我和博士两个工科生负责研发，另外两个女生负责产品和UI设计工作。\n\n鉴于第一天我们安卓开放功底比较薄弱，我们先快速装好开发环境并进行安卓快速入门，同时等待产品和UI那边的产品方案，在之后三天里开始天天写代码、调试，终于赶在验收前做完。这期间确实感受到了开发童靴的辛苦，天天对着电脑全神贯注写代码，每次运行代码时生怕出错的紧张，好不容易写好代码被产品改需求的坑等等。\n\n2．开发眼中的好产品经理\n\n在跟几位资深开发的交流过程中，了解到在他们眼里一个靠谱产品经理的必备素质：\n\n首先，把各种逻辑想清楚，对各种可能会出现的异常处理等问题要尽量全的考虑到，比如点击一个页面进入到下一个页面时，会出现几种情况，某种情况下是否会出现逻辑错误，这些问题如果产品经理在脑海中想的时候很有可能会因为太抽象而不能顾全，但是开发童靴写代码的时候肯定会具象化所有可能的情况，防止出现bug，所以，有的时候试着从开发的角度来思考某个需求的实现情况，可以让逻辑更清晰。\n\n其次，要能扛得住压力，有的时候遇到上面要改需求时，自己也要站在用户的角度去思考一下，甚至在必要的时候也要发表一下自己的建议，扛得住压力，不要一甩手说上面让改需求，这其实也是一种不负责的态度，而且在出现问题的时候，如果确实是自己产品方面存在的问题，应该勇于承担，改自己背的锅自己要扛得住。\n\n再次就是要把控住时间进度，每天下班时间可以和开发等童靴沟通一下今天的进展，甚至当天体验一下最新版本等，如果遇到问题尽快反映以便让开发童靴更快的修复。\n\n3．如何更好得协调需求落地\n\n当有一个需求时，应该如何协调与开发、设计、老板、测试等不同角色共同推动需求落地呢？最初比较天真得认为产品经理先把具体想法想清楚然后去找开发讨论技术实现难度，如果OK就让设计直接出视觉图，然后让老板拍板后开发童靴进行开发的流程，但是在和有经验的开发交流过发现后，这个看似比较正常的流程里面其实暗流汹涌，因为如果每个环节只是考虑某一环节的人，忽略了整体性，而且如果出了视觉再去向老板汇报，如果不符合期望的话，返工的成本也较高。所以其实有了具体的想法后就应该先拉开发和设计童靴一起进行具体落地方案的讨论，让每个人都有参与感，得到一个综合的方案后向老板汇报，通过后再按流程推进方案落地。\n\n最后非常感谢这一周的开发体验，无论是在技术上还是如何与开发童靴相处方面都学到了很多东西，在此也特别感谢一周来一直给我们授课并耐心答疑的bingkai、bilsonzhou、cavanwei、jesonwang、stenvencai、rangerzhang六位开发大牛,也感谢公司提供给我们这么一次很棒的体验机会，这周就要开始设计岗的体验了，敬请小伙伴们期待新的分享哦。"
 },
 "specials":"",
 "defaults":""
 },
 {
 "cellModelType":2,
 "articles": {
 "headPortrait":"222",
 "userName":"我养了只鹿 ",
 "time":"昨天",
 "article":"比我们优秀的人，还比我们更努力",
 "special":"作者",
 "reading":"1541",
 "comments":"16",
 "likes":"87",
 "articleImage":"222",
 "articleText":"\n我最开始接触艾力时，是通过微博上的酷艾英语早起团。当时的我还不相信真的会有人自己出大把的钱来给持续早起、健身、读书的人送精致又免费的小礼物。\n\n一开始我以为是土豪闲的没地方花钱，后来看到他出的一本书《你一年的8760小时》，有着这样的一段话：“愿我所见之人，所历之事，哪怕因为我有一点点的好的改变，我就心满意足了。”\n\n就是这样一个心怀善意的人，尽管作为新东方集团演讲师及集团培训师，收入不低，脚上穿的球鞋仍然是考上北大后妈妈送的礼物，电脑也是爸爸的遗物，天天背的双肩包是某次主办方送的嘉宾礼品，西服才两三百块。却愿意花费10万多元自费赠送礼物给网友。\n\n这个时候我才将这个新疆小伙子区别于财大气粗的地主。\n\n艾力，全名努尔艾力·阿不利孜，《超级演说家》 、《奇葩说》人气选手，新东方18000名教师中12位集团演讲师之一，个人《酷艾英语》节目网络点击量超5000万。24岁时就成了新东方集团最年轻的集团演讲师，拥有八块腹肌和人鱼线。\n\n24岁的我们还在干嘛？上大学？找工作？上班？还是在家带孩子？\n\n艾力年纪轻轻就如此成功，如此优秀，作为普通人家的孩子，我们的第一反应都是：穷其一生，我们怎么可能会有这样大的成就，反正我怎么努力也追不上了，男神基因那么好，我们还是得过且过吧。\n\n可是男神一开始并不是受人瞩目的男神，他也曾经是个扔人堆里找不到的普通人，还是个180斤追不到女生的胖纸。\n\n2\n\n初中时候他胖的不行，追女生屡追屡败，屡败屡追。作为一枚资深胖纸，减肥谈何容易，不仅要靠运动，还要调节饮食。而作为一个在新疆长大的孩子，对肉类等高质量食物情有独钟。\n\n为了减肥，他下定决心将每周必吃的一次大盘鸡，控制到一顿都不吃。甚至连多吃一口冰淇淋都会产生罪恶感，每天坚持跑步40分钟以上，在健身房里接受魔鬼教练的摧残，坐火车时，甚至会在没有人经过的火车过道里做仰卧起坐和俯卧撑。\n\n后来的后来，他忍受住了诱惑，靠着惊人的意志力，从原先180斤的胖纸减肥成功为72公斤的拥有八块腹肌、人鱼线的男神。\n\n而他所有关于英语方面的成就以及荣誉，都是靠自己一点一滴打拼出来，并不是轻松靠着自己的英语天赋。\n\n3\n\n从18岁孤身一人来到离家3000多公里的北京求学，到现在7年的时间，期间还经历着父亲意外过世的打击。租房曾5次被拒，手机掉到过马桶，也被骗了钱，丢了护照。\n\n为了养家糊口，他每天早上都是第一个到公司，加班到最后一个离开。甚至为了工作，住在了办公室里。又总是因为太专注于工作总是错过吃饭，饿到胃痛时才想起来吃饭。\n\n一度连续工作10个小时，甚至发烧到40度时，他为了不耽误工作，宁肯坚持到工作结束后才去看病，甚至在医院挂号排队的时候，他还在懊悔生病耽误的工作如何在过后腾出时间补上。\n\n说真的我没有想到过，艾力会为了自己的工作如此拼命，我也没想到过，看似轻松有趣的《酷艾英语》视频的背后要花费如此多的心血。\n\n4\n\n总共有52期的酷艾英语，总点击量超过5000万次，而视频播放时间只有5分钟。艾力在这个视频付出的时间远远超过5分钟。\n\n为了不太麻烦剪辑师，每录制5分钟的课程，艾力都会提前把视频讲15-----20遍，也就是说练习加上做PPT的时间，一共需要10小时的准备时间。这过程的枯燥以及大量的重复性怕是常人难以忍受的。\n\n而酷艾英语的录制场地，是借用其他老师录制收费课程的间隙录制的。因为不能占用早九点到晚九点的黄金时间，艾力只能选择大家下班后再过去，也就是说在大家都准备休息的时间，艾力还在录制视频，从晚上9点一直录到凌晨两点。\n\n5\n\n在你们眼中，台上的艾力光芒万丈，聚光灯都紧紧跟随着他，似乎天生就有演讲风范，似乎天生就是当英语培训师的命。\n\n可一开始，并不是大家想的这样的，所有的成功并不是水到聚成。\n\n一开始，他也是个一上台就容易紧张的人。为了克服自己性格里的懦弱，他几乎看了所有他能找得到的关于演讲之道、演讲技巧之类的书籍，以及几乎所有的名家演讲视频，反复观看，不断刻意练习，甚至还会把自己演讲中出现的错误用本子认真地记下，不断进行纠正练习。\n\n后来的后来，你也知道了，艾力站在了拥有成千上万的新东方“梦想之旅”系列演讲的现场。\n\n6\n\n畅销书《异类》的作者说过，人们眼中的天才之所以卓越不凡，并非天资超人一等，而是付出了持续不断的努力。\n\n亚里士多德说过，我们每个人都是由自己一再重复的行为所铸造的。\n\n训练艾力减肥的教练说过，“你真的想练肌肉吗？你要知道，想增肌到位，就是要感到痛才行，只有练到酸痛，晚上回去好好休息加上补充蛋白质，你的肌肉才能成长。如果没有痛感说明你今天根本没有练到位！”\n\n而我们习惯性把性格交给星座，把努力交给鸡汤，把考试交给锦鲤，然后对自己说“听说过很多道理，依然过不好这一生，”\n其实打从一开始，你就没想着去努力，你总是害怕做那些简单重复的事情，生怕自己多浪费一点精力，可极容易被我们忽视的一点是，所有成功的人，都是把最简单的事情做到极致。\n\n我们还有什么理由不努力？！你不逼自己一把，你永远都不知道自己有多优秀！！！"
 },
 "specials":"",
 "defaults":""
 },
    {
    "cellModelType":2,
    "articles": {
    "headPortrait":"222",
    "userName":"G1enY0ung",
    "time":"昨天",
    "article":"坚持住，慢慢来（送给大学的程序员）",
    "special":"作者",
    "reading":"2435",
    "comments":"100",
    "likes":"12",
    "articleImage":"222",
    "articleText":"\r\n开篇\n作为一个计算机科学的学生，我们需要做的是找到一个自己感兴趣的路线，找到一个属于自己的学习方法，让兴趣驱动着自己，不断深入的探索。计算机的世界很奇妙，当你真正踏入进来后，你会感到它的魅力是无法形容的。\n\n下面以我的个人经历为蓝本叙述一下一个计算机科学的学生的成长以及学习方法，仅为个人观点，希望能帮助到大家。\n\n我们在学校首先接触的一般是C/C++或者是C#，我们学校就是以C为起点的。在国外的高校也有以python为起点的，但是国内却不多，所以在此我暂不供述，在我看来都很不错。首先，像C这样的静态类型语言，你需要为你的变量去声明数据类型，进一步的说，可以主动分配你需要的内存块，说白了，你做什么都取决与你自己，所以你在书写的时候需要小心。for example:\n\n#define BUF_SIZE 50\n\nint a[BUF_SIZE] = {1, 2, 3 ,4};\n\nprintf(\"%d\", a[51]);\n这明显是错误的。但是你在编译阶段是不会收到error的。\n\n学习C这样的语言的好处是，可以让你对任何的数据类型都有所认识，对每一内存块都有所考虑。但是它对初学者我认为的比较大的缺点就是：写啥都是那点黑框框，写着写着就没意思了。我在我之前的学习中也体会过这种感觉，我后来也向我周围的同学们求证，我发现大部分同学也有过这样的感觉。\n\n整天就摆弄一个黑框框，写写就不想写了\n\n没错，就这样我们不断的学习着一门的语言的语法，马上，我们就会踏入数据结构的大门。说实在的，数据结构可以算是计算机科学的基石了，但是作为一个初学的人可能不会意识到这一点，加上数据结构一般会以我们入学时学习的语言来去实现。慢慢的，部分的人由于对学习的语言丧失了兴趣，然后又碰见”枯燥“的各种链表堆栈树图。。。等等。对知识的兴趣一步一步的降低，加上有的人本来理解能力较差，从而彻底对所学习的无感。再以后会学习数据库，操作系统，网络的知识同样也会感觉索然无味。\n\n就这样陷入了恶性的循环，越来越没有兴趣去学习\n\n我身处一个三本学校，我周围的大部分人都对学习这件事情报以无所谓的态度。在这些人之中，有的从一开始就是来混的，这我们不管。另外的这之中的部分人，他们一开始也有一颗向上的心，可是由于缺乏对知识的兴趣，加上差劲的学习氛围，一步一步自我放弃，到最后每天看视频打游戏，这样的例子很多，我也算是都见过了。因为我也有一段时间天天打游戏，我承认确实感觉很爽，也没有人去管自己，就玩被。\n\n到这里，我要开始说重要的东西了。我们来到了大学，难道要浪费我们的珍贵的时间吗？我们要浑浑噩噩的度过这四年吗？在大学里，总是要生活的激情一点，天天养老也没什么意思对吧。如果你是因为我上面说的原因，想学习但是找不到兴趣点，或者是因为学的很迷茫，那么我觉得我应该能给你一点启发，就从现在开始吧。\n\n从零开始\n除去学校学习的C/C++，我第二个接触的是关于渗透方面的知识。渗透测试，在我当时看来就是Hacking，第一个使用的工具是sqlmap：一个自动化SQL注入和数据库数据抓捕的测试工具。当时看网上视频演示的时候简直狂拽炫酷吊炸天啊，动动手指头就获取了网站后台的数据库的数据。。看的我内心十分激动，所以我也下载了一个，按要求配置好，天真的扫描了一下baidu.com。。。发现并不好使啊。。。\n\n当时想，妈蛋这怎么一到我手里就折了呢，试试别的，然后把国内的各大网站都试了一遍，结果你懂的，连根毛都不能找到。。。\n\n一脸黑线。。然后我就从百度找了点学习视频去看，中间有一段教授各种命令，原来有可以利用google去寻找注入点的技巧啊，先试试，然后发现需要翻墙。。我又去寻找翻墙工具，找了半天，找到了个免费的shadowshocks，卧槽你别说，还真找出来了不少，接着一个一个试，也不知道试了多少个，最后都麻木的复制粘贴了。\n\n突然，诶，没有红色的error！找到了！我很记得当时心情很激动，然后接着看教学视频，看看人家是怎么做的，边模仿边打命令，一步一步我查到了表，然后查找列，最后寻找user，password字段，perfect！找到了好多的用户和密码，可是密码怎么这么长，继续百度！原来是已经加密过了的，找了个MD5网站解密，成功解了出来！我也攻破了一个网站，哈哈小小的成就感（虽然后来知道了这种网站早已经没有人维护了，但是当时不太懂还是感觉很好的）。\n\n后来紧接着大一下学期的期末考试来临，暑假来临，继续鼓捣我的sqlmap！后来（引导我上道的人）马哥告诉我，你可以试试kali linux，里面有好多的工具。啥玩意？啥linux？我先百度一下是什么。。原来是一个集成众多测试工具的操作系统。这个好啊，下载下来玩一玩，安装就废了半天劲，进去了之后，找不到文件夹。。当时用习惯windows的我真的是一脸的懵逼啊，没办法，先学学linux的基本操作，要不怎么用这些工具啊。就这样，有点闲工夫我就鼓捣鼓捣，一开始用虚拟机攻击自己主机，后来利用metasploit制作恶意程序装到了我爸的手机里，然后开我爸手机的摄像头哈哈。就这样，当时也觉得自己有了点学习的动力，找到了点学习的乐趣。\n\n总结一下\n\n我这时对渗透测试感兴趣，说明我找到了自己的可能存在的兴趣点\n不会的地方多加尝试，多去百度，你就能发现自己想要的\n多了解了解各种知识，不要局限于学校学习的，途径可以有多种，比如我接触到渗透测试是从我的组长（马哥）那里得知的\n不断改变\n后来开学了，在马哥的隔壁上课，后来可能是他问我想不想跟他写个网站（具体过程忘了），由于在暑假不断玩测试工具，也看了一点html的知识，感觉这个也挺有意思的，好吧，这次我又走上了写web的道路。一开始，我们写的是一个数据查询的页面，他负责后端，我管写点界面，ok还是老样子，先找找有没有教学视频，网上这种东西还是挺多的，就开始看。溜了一遍html标签，每个例子跟着做一做，好像写完了页面不怎么好看啊。。。当时看的是一个叫做菜鸟教程的网站，哦，原来还有一个叫css的东西可以帮我把页面做的漂亮一点，学！\n\n一天下午，马哥看我在浏览器上量像素的时候，问我干啥呢？我说这不是比较下宽度吗。他说，你别这么写了，费劲啊，你看看bootstrap，一个框架，挺好用的。\n\n。。。什么玩意，一脸懵逼，百度吧。看了好几个小时，可算明白了，原来是twitter工程师为了方便我们写web项目，直接提供了我们各种基本的组件啊，学！后来花了两天去学习，确实相当好用哈哈。\n\n就这样写了一个又一个页面啊，时间也过得很快，转眼间10月1了，放了七天，也没回家，愣是在寝室用七天把C primer plus看了一遍（具体为啥看我也忘了。。），后来马哥跟我说他想写一个“真正”的网站，我说咋写啊，他说我们用python来写，还是用框架。\n\n好啊！早就想写个牛逼点得了，天天写静态页面没啥意思啊，马上就答应了。我们预计的是11月15号写完，10月15号计划了这个工程，就这样开工了。之前听马哥的学了七八天的python语法吧，然后我就直接接触了Django框架，当时觉得这个跟天书一样，官方文档全是英文的，啃半天也啃不动多少，现在很明白的model，view，url当时却怎么也看不懂，百度的资料也都是之前的了，啊咋办啊，先模仿吧。对着文档的例子一个一个敲，买了python web开发的书，对着书上的代码敲敲敲，别人的教学博客，一个一个敲。我也不知道是怎么回事，好像懂点了，看来机器记忆也的到了一点成效。紧接着，我接触到了github，搜索了一下，哇塞，这么多别人做的Django开源项目，然后我就对着别人的源码开始敲。期间，锻炼了我的代码阅读能力，看英文文档慢慢地也不那么费力了，有的抄有的写，我一步一步的完善这我的网站，第二天，登陆注册功能完成，第四天，信息发布功能完成，第七天，前端页面接近完工。\n\n第九天或者第十天，记不太清了，我完成了网站的制作。那几天，我把我的全部精力都放在了这个上面，课也不听了，游戏也不玩了，基本每时每刻我都在思考如何完善我的网站吧，现在看来，当初做的网站真的一般般，不过我还是肯定我当初的作品的。\n\n这是我兴趣和努力的结晶，也是我的第一个学习成果\n\n总结\n\n虽然我当时不是主动接触各种新事物的，但是兴趣驱动了我去完成了我当时想完成的事情\n我从那时意识到了，学习没有那么的枯燥无味，相反是那么的有意思，学习可以让我做我想做的事情\n阅读英文文档，源码的能力对于程序员很重要\n不要遇到困难就放弃，今天不懂不代表明天不懂\n最终目标\n经过上述的过程，潜在的，我发现了我不断变强的两个方面：\n\n自主自学能力的提高\n独立思考能力的增强\n我转变成了我可以独自寻找我想要的东西的人。通过不断的学习，我开始寻找我最终的兴趣点，接触python，接触C++，javascript， ruby等等，我去寻找资料去了解现在世界上的主流技术，创新技术，Big Data， Mechine learning等等。发现百度搜索的东西命中率不如google的高，发现了番茄工作法，可以规划我的时间。在每个下一天我都有可能推翻我前一天的想法，不断的思考是一个能让一个人升华的事情，你可以建立一个你自己的思维模式，构建出自己的网络，拥有你自己的观点，我觉得这些都是一个人宝贵的财富。\n\n这些不断的改变我的生活方式，我觉得也可也可以改变我的未来，也可以让我达到更高的高度。现在我已经有了我不断努力的方向，同样也是我感兴趣的方向：系统编程领域。我在不断的探索着一切关于它一切好玩的地方。\n\n这篇文章就到这里结束了，最后的总结：\n\n兴趣点一旦最终建立，剩下的就是为之努力\n让思想不断延伸到未知的地方，让自己更充实\n把自己的时间规划好，我推荐番茄工作法\n拥有一个健康的身体，一个良好的作息，这可以帮助你很多\n希望看到这里的人能够帮助身边的人一起成长，因为别人曾经也帮助过我，所以我有一种帮助更多的人的想法，让我们不断传递，让大家都寻找属于自己的道路\n也没写过几次文章，可能语言组织不好，条理可能不是很清晰，希望大家谅解。\n\n本文写给XYX，希望能帮助到你。学习并不难，坚持住，慢慢来。"
    },
    "specials":"",
    "defaults":""
    },
 {
 "cellModelType":2,
 "articles": {
 "headPortrait":"222",
 "userName":"剽悍一只猫",
 "time":"昨天",
 "article":"我就是那个读书多的农村人",
 "special":"签约作者",
 "reading":"1754",
 "comments":"55",
 "likes":"136",
 "articleImage":"222",
 "articleText":"\r\n﻿1﻿\n\n我出生在农村，直到现在，我的户口还在那里。﻿\n\n在高中之前，我不知道奶粉啥滋味儿，但我喝过纯牛奶---家里有头黄牛，母的，它生小牛以后，我跟小伙伴们挤过它的奶，发现一点都不好喝。﻿\n\n因此，我认定电视里的广告是骗人的，那些拿着牛奶盒子喝得很开心的小朋友都是在演戏。﻿\n\n2﻿\n\n读初中的时候，遇到一个非常好的班主任，他经常会找我谈话，告诉我读书的好处，告诉我山外面的世界有多精彩，还让我知道大学有多好玩。\n\n虽然，他只是一个高中肄业生。﻿\n\n作为一个没见过什么世面的人，他的话对我起了很大的作用。\n\n我开始在他的监督下努力，学习成绩有了极大的提高，比如英语，初二下学期的时候，只有17.5分，初三上学期的半期考试，竟然考了55分。﻿\n\n到了初三下学期，我的英语已经稳居年级第一了，能考70多分。（在我们那个山区中学，英语能及格的都是“高手”）﻿\n\n3﻿\n\n努力加运气，我考上了县里最好的中学，实现了人生第一次进城。报到的那天，我坐了4个小时的汽车，很少坐车的我，经不起颠簸，一路狂吐。﻿\n\n军训结束后，我们开始上课了。有一次，班上一个女同学拿着本子，问我要什么扣扣号码。﻿\n\n什么是扣扣号码？我真的不造啊！我只知道电话号码……﻿\n\n经过一番挣扎，我把家里的座机号码写在了她的本子上。我记得她当时说了一句，不错哟，还是七位数的。﻿\n\n三年后，我第一次用QQ，心情极其复杂。﻿\n\n4﻿\n\n高中真是一个很神奇的阶段，上课、做题，上课、做题，素质教育跟我貌似没半毛钱关系。﻿\n\n那时候我特别羡慕初中毕业就去打工的同学，自己挣钱花，还不用做这么多题。﻿\n\n稍微欣慰一点的是，我们这些离家太远的学生，周末不用回家，也没人逼着我们补课。﻿\n\n哈哈，县城里的同学就比我们悲惨多了，各种学习班，累得半死。﻿\n\n周末干嘛呢？去书店看书！哈哈，教材教辅都滚开！﻿\n\n高中三年，我读了很多正能量满满的鸡汤、人物传记，在很幼稚的年龄，这些书给我带来了无穷动力。﻿\n\n5﻿\n\n好不容易考上大学，我来到了一个巨大的省会城市，面对那些高楼大厦，我内心无比自豪，我也可以在大城市生活了！﻿\n\n大学里，有看不完的美丽姑娘，有读不完的图书馆藏书，有参加不完的各种活动，跟高中比起来，简直就是天堂。﻿\n\n虽然，在这里我看到了巨大的贫富差距。﻿\n\n6﻿\n\n读大学并没有让我变得很牛逼，但是，我身上的屌丝气被洗掉大半。﻿\n\n作为一个很瘦的人，我很努力地去练功夫，让自己变得更有安全感。﻿\n\n为了开阔视野，我读了很多书，参加了很多活动，甚至去其他大学蹭课，见识了很多优秀的人。﻿\n\n为了让自己“很有才”，我练唱歌，说相声，演小品，虽然都是半罐子水，但至少我比以前要自信很多。﻿\n\n后来，我还考上了公费研究生。﻿\n\n7﻿\n\n从2011年到现在，我在买书上花了四万多块钱，加上经常逛书店，手上翻过的书也有好几千本了。﻿\n\n书的内容，绝大部分没记住，但它们一直在滋润我。﻿\n\n我跨界教英语，最大的优势就是我比一般的英语老师“博学”，学生在我的课堂上能听到很多不一样的好东西。﻿\n\n作为一个没有写作习惯的人，这段时间写了这么多东西，如果没有之前大量读书的积累，真的很难想象。﻿\n\n8﻿\n\n同村有个发小，他初中毕业后就没有继续上学了，不过，他现在广东混得很好，有厂有车。﻿\n\n我跟他很有共同语言，每次回家，我们俩都能聊得很嗨。﻿\n\n他学历不高，读书量却不小，他经常会去书店泡着，找优秀的人请教，参加夜校学习。﻿\n\n他的知识储备、见识、语言表达能力比一般的大学毕业生要强很多。﻿\n\n他说，他的手底下有很多211毕业的人，都很服他。﻿\n\n9﻿\n\n如今，我们都生活在城市里，我们会去看电影，我们会去吃西餐，我们看起来跟身边的人没什么两样。﻿\n\n甚至，比他们更优秀。﻿\n\n结束语﻿\n\n农村的孩子，城里的孩子，都应该多读书。﻿\n\n不要以为上学才叫读书，真正的学习从来不挑地方。"
 },
 "specials":"",
 "defaults":""
 },
 {
 "cellModelType":2,
 "articles": {
 "headPortrait":"222",
 "userName":"技匠",
 "time":"昨天",
 "article":"每个程序员都应该了解的一件事",
 "special":"作者",
 "reading":"3388",
 "comments":"39",
 "likes":"175",
 "articleImage":"222",
 "articleText":"\r\n我曾经接触过一些IT高管以及行业的技术大牛，当私下聊起他们是如何变得如此出类拔萃时，他们大多会以自嘲又略带得意的语气来讲述他们的那些独门秘籍。\n\n我的文档写得特别好。\n我的口才很好，总是能成功说服别人。\n我的PPT做得非常棒，是公司里数一数二的。\n我写过几篇很受欢迎的技术文章。\n我热爱开源文化，并在社区里很有名气。\n......\n我发现，这些普通人眼中的大神们很少会提及自己的技术有多牛，反而更多地把功劳归于那些看似与技术毫无关系的能力上。大家千万别误以为他们只是一群华而不实，靠着一些小伎俩往上爬的小人。完全不是，而且我敢向你保证，他们中的每一个人在担任程序员或负责其他技术工作时，同样都有着非常出色的技术能力和优秀的工作表现。但为什么在他们眼中这些还不足以使他们达到现在的高度，反而是那些不起眼的写文档、做PPT、演讲等这些技能使他们能够在一次次竞争中胜出，并成为了我们中的佼佼者呢？\n\n其实在我看来，他们所谓的这些秘籍，都可以被归纳为一种能力，那就是自我营销。只有具备了这个能力，你才能脱颖而出获得成功，这一点对程序员同样适用。\n\n我的这个观点可能会令很多程序员感到有些沮丧，因为和曾经的我一样他们热爱写代码，并愿意以此作为终身的事业。甚至有些人是由于自己内向的性格才选择当程序员的，但你需要明白，你写的代码可能毫无用处，直到：\n\n人们理解你在做什么\n人们对你所做的事情感兴趣\n人们为你的所作所为感到兴奋和激动\n大多数刚走出校门的年轻程序员们绝不会把“自我营销”作为一项自己需要具备的技能来关注和学习。他们往往一头扎进自己所热爱的某一个技术领域，不断追求着更高的技术水平。我个人其实非常推崇具有这种精神的年轻程序员，正如我在“给职场新人的10点职涯建议”中所提到的10,000小时定律，那些能够在某一领域获得成功的人都需要花费至少10,000小时的努力，而对于普通人来说，你的努力也的确与你所能获得的成就是成正比的。既然这样，那为什么我们还需要学会自我营销呢？答案是：自我营销往往能够有效地放大你所做的努力，并且在你成功的道路上起到催化剂的作用。尽早地获得成功对于我们这一代程序员来说异常关键，因为这个世界上有许多与你一样努力的人，但有些人在最佳的时间点获得了成功，而另一些人虽然也通过努力达到了相同的能力，但错过了那个正确的时间点，从而走上了一条完全不同的道路。\n\n我看过很多这样的例子：\n\n刚进公司时，一群年轻的程序员能力水平都差不多，他们也都非常努力，但他们中的一些人能够通过出色的自我展示，获得老板、同事以及客户的信任，他们也自然获得了更好的升职机会，做上了团队领导等角色，从此走上了事业的坦途。而与他一起进来的那些程序员可能还在那里敲着代码，日复一日地做着比较基础的工作，并时不时地抱怨着：他的技术还不如我呢，他凭什么就能升职呢？\n\n可见，一名程序员如果能够尽早意识到自我营销的重要性，并有意识地锻炼和运用这个能力，那将对你的事业产生很大的帮助。\n\n那么对于程序员们来说，又有哪些能偶提升自我营销的能力办法呢？下面便是我的一些建议：\n\n读与技术无关的书\n我刚毕业后的2年时间里买过很多技术类书籍，这帮我打下了良好的技术基础，后来我就不再买技术书了，因为我发现学习技术的最好方式是在互联网上，那里有最新的教程、文档和资源。因此，我建议只买一些经典的技术书籍来帮你打基础，然后从网上去学习一切新的东西。\n\n我尤其鼓励大家去读那些与技术无关的书籍。程序员不善于自我营销，其中一个重要原因是，他们自身所掌握的知识体系太过于单一，很难跳出技术范畴与人交流，并引起别人的兴趣和认同。你可以读任何历史、经济、人文、艺术类的书籍，它们都能够帮助你丰富自己的知识和思想，使你变得更加全面和完善，这反过来，又能帮助你建立信心。\n\n\n当然，你还可以读一些优秀的人物传记，从他们身上你可以获得成功或失败的经验，并且完善你自己的人格。我是在自学设计的那段时间里读了“乔布斯传”的，我从没见过任何人像乔布斯那样，能够对自己所从事的事业和创造的产品达到这样疯狂、苛刻的地步。他的这种追求完美，对产品的设计和质量苛求的态度，都对我日后的工作行事产生了积极的影响。\n\n会写文档\n我见过很多程序员，他们对自己写的代码非常认真负责，经常反复进行检查和测试。但每当让他们写文档或作一些PPT介绍时，他们却显得很为难甚至反感。而写出来的文档也往往质量很差。\n\n我也当过程序员，因此很能理解他们的想法。当一名程序员写完整段代码，完成一项工作后，他们对于代码所实现的逻辑是最熟悉的。对于他们来说，写文档完全就是为别人而写的，对自己没有一点好处，纯粹是在浪费时间。而且，对大多数程序员来说，给机器写代码要比给人写文档容易得多。\n\n而我想说的是，恰恰相反，文档可能是你完成代码编写后一个最佳的展示机会。当代码实现了它的功能之后，就很少有人再会去看它，除非它出错了。但文档被阅读的几率却大得多。从一个文档中，我们可以看到关于作者的很多东西，思路是否缜密，逻辑性是否强，设计方案是否优秀等等。可以说文档质量的高低是衡量一个程序员是否优秀的重要标准之一。即使你离开了公司，你所写的文档很可能还会保留很长时间，被很多后来者阅读，而你的声誉也是在这一次次的阅读中被构建的。优秀的文档能够让人们对你产生信任和好感，而相反，质量差的文档则会使你的声誉受损。\n\n学会包装\n说到包装，人们往往会产生一种不好的错觉，把包装与虚伪、假的东西联系在一起。其实我所说的包装应该包含两层意思，\n\n1.知道什么是美的（优秀的）\n2.精心制作\n\n这个想法来自于最近参加的一次保监会关于偿付能力改革的会议，整个方案是由普华永道提供咨询和实施的。会上他们的高级经理通过一个长达114页的PPT介绍了项目的背景、技术细节、实施方案等信息，整个PPT制作得非常精良，内容组织也很有条理，让人一目了然，顿时对整个项目团队产生了很好的印象。可以说普华永道通过一个精心制作的PPT完成了一次非常有效的自我营销。\n\n在日常工作中，我经常发现身边的程序员很难写出美观整洁的文档或PPT来。这一方面与我们从小缺乏美学教育有关，而更重要的往往是他们并没有真正用心去制作它。其实，我们可以通过寻找一些优秀的文档示例来学习如何制作优秀的文档，这其实并不困难。知道什么是优秀的，然后像写你的代码一样用心去制做就行了。（ 如果你对设计也有兴趣，不妨也可以看看我的另一篇文章“自学设计，你真的入门了吗？” ）\n\n尝试多讲\n讲话一直是很多程序员的硬伤，当然这也曾是我的硬伤。根据我的经验，你需要跨过以下两个障碍。\n\n1.敢说\n2.让说的和你想的一致\n\n我经常看到一些程序员，他们平时跟熟悉的人都能很好地交流，而一旦到了会议上，特别是有老板或客户在场的情况下，就变得难于开口。程序员的性格特点大多是内敛含蓄的，在一些正式的场合他们会显得对自己缺乏信心。我想说的是，这需要通过平时多锻炼来克服，还记得我在“给职场新人的10点职涯建议”中提到的那个被老板逼着每天做一次公开演讲的咨询师吗？是的，你应该在还处于职业生涯的初级阶段的时候，就开始有意识地锻炼讲话的能力，特别是在一些不那么重要的会议上，一方面你说出一些不那么准确的意见时，不会产生太严重的后果，而同时你又可以很好地锻炼自己的表达能力。程序员遇到的另一个问题是，他们所讲的往往不能不能真实反映自己所想表达的意思。通过创造机会多讲，你才能更好地掌握使用语言的能力，并通过不断总结，这样你很快就可以非常流畅地表达自己的想法了。\n\n建立社会化联系\n一个完全封闭的程序员一定不是一个优秀的程序员。优秀的程序员往往愿意并善于与他人交流，分享自己的经验和想法，并在交流中获得有益的东西。这样做有很多好处：\n\n通过这些社会化的活动能够使你的想法和技能更加完善。\n能够使你建立权威，你的技术博客，在一些社区上的技术问题解答，以及你的开源项目等等都会使人认为你是这方面的专家。\n同样，你也可以获得他人的帮助，来解决棘手的难题。\n你可以找到与你有相同兴趣的人，一起做有趣的事情。\n你的社交网络将因此扩大，这意味着你所获得的机会将会更多。\n......\n我本人就是这方面的受益者，我刚毕业时在一家建筑软件公司工作，做的是Delphi开发，但我很快意识到互联网才是未来的方向，因此我自学了JAVA，并开始以JAVA软件工程师为目标，去寻找工作。但由于没有任何项目经验，我经常碰壁。一次偶然的机会，我看到BEA Dev2Dev（BEA被Oracle收购后，这个网站已经关闭了）有接受技术类文章投稿的讯息，我马上连续写了两篇技术自学类的文章，并很顺利地通过了审稿，不久便在Dev2Dev发布了。我将我的这两篇文章链接写入了我的简历中，之后，我很明显地感觉到让我参加面试的电话明显比之前多了起来了，我也很快通过了一家外资软件公司的面试，成了一名JAVA工程师，从此走上了事后看来更好的职业道路。\n\n最后，我想告诉你的是，在这样一个时代，程序员是一个充满可能性的职业，你可能成为下一个马云，甚至可能是乔布斯（马云和乔布斯都有一个共同点，那就是他们很早就掌握了自我营销的能力）。如果，你并不想仅仅是一名程序员，你只需要在潜意识中埋下一颗“自我营销”的种子，让它跟随着你慢慢成长，相信我，你的未来将会因此产生很大的不同。"
 },
 "specials":"",
 "defaults":""
 },
 {
 "cellModelType":2,
 "articles": {
 "headPortrait":"222",
 "userName":"似水君",
 "time":"昨天",
 "article":"Taylor Swift就是我的心灵鸡汤",
 "special":"作者",
 "reading":"1398",
 "comments":"25",
 "likes":"61",
 "articleImage":"222",
 "articleText":"文：似水君\n\n从初中开始知道、了解、喜欢Taylor ，至今已有七年，可以说，我见证了她从一个无所畏惧的女孩，成长为如今国际巨星的过程。虽然大众对她褒贬不一，但是在我心里，她依旧是原来那个阳光灿烂的女孩。\n\n我敬佩她面对流言蜚语时的淡定从容，甚至她会利用那些攻击她藐视她的流言，写出脍炙人口的歌谣。一首《Mean》，让我靠近了她，歌词中，她对那些讥讽她不会唱歌的人，进行了畅快淋漓的暗讽，她唱道「有一天我要在格莱美唱这首歌，而你所剩下的只有卑鄙」。果然，她真的在格莱美表演了这首回肠荡气的《Mean》。她用实际行动给所有人上了一课：即使被小人贬得一文不值也要坚持自己的梦想，相信自己能成功！终有一天，你会强大到让那些侮辱你，看不起你，攻击你的人，只能仰望你，再也无法击败你！\n\n我欣赏她的才华。她是唯一一位拥有三张首周百万销量专辑的歌手。而她的才华不仅在于逆天的创作天赋，更在于她的自嘲。媒体将她塑造成一个滥情，可怖的女人。她就写出《Blank space》，自嘲自己是个多情的人，编撰了一场荒唐的爱情故事，而这首《Blank space》蝉联了Billboard冠军宝座七周之久。她说“一半的人知道我唱的是个笑话，而另一半的人真的以为我疯了！”\n\n我钦佩她的勇气和决策的果断。当她在乡村音乐歌坛发展蒸蒸日上的时候，不顾团队公司的反对，毅然转型往流行音乐进军。事后也证明，Taylor的决定是正确的，她拥有把控全场的能力。而如今身为巨星的她，淡然地宣告暂别舞台，开始休假。在制高点能够逆流而下的勇气令人敬佩，生活和事业的平衡让她从容不迫。\n\n我羡慕她可以有足够自己翱翔的领域。她一步一个脚印，慢慢地从一个青年歌手，成长为国际巨星。在她的领域里，她可以坦然收获掌声、热情、赞美。她说“唱歌会让我放松，我很享受舞台的感觉”。我想像她那样开拓出属于自己的一片小天地，在这小世界里，我可以是国王，可以自在漫步，充盈我的心灵，获得精神上的巨大满足！\n\n\n图片来自网络\n对我而言，Taylor 就是我的心灵鸡汤。从初中我就开始住宿，自那时起寂寞孤独时常萦绕着我，而泰勒就像一束光，斥退我身边的魑魅魍魉。都知道她写前男友的歌很出名，但还有很大一部分的歌曲都是在教大家去忽略那些流言蜚语，藐视那些扰人心绪的人和事，净听起来总是酣畅淋漓、荡气回肠。\n\n2015年的光棍节，Taylor来上海开演唱会。下午四点半，我躺在寝室，刷着大麦网。意外的，官网开始漏票，我突然兴奋起来，抢了票，从奉贤一路赶到浦东，离开场十分钟，进场。在车上我是激动的，我意识到以前那个敢说敢做充满灵气的自己又回来了。那一瞬间，久违的感觉让我想哭。没有预定好酒店，没有计划好行程，没有约好伙伴，因为Taylor，我终于再一次果断决策，好像进了大学以后那优柔寡断，顾前顾后的我不见了，我欣喜自己的突破。\n\n见到Taylor，是一种见到精神领袖的感觉。在唱《Clean》之前，她字字珠玑的解说，让我眼眶泛湿：\n\n总有很多人在你身边指指点点，告诉你什么是出色的，什么是美好的。我们总是很容易被这样的想法先入为主的误导，就是一定要成为很出色的人。但是我觉得，比做个出色的人更重要的是做个快乐的人。\n\n当有人批评你，或者在背后说你坏话的时候，这些流言蜚语，每一句都化作锋利的武器刺痛你，让你遍体鳞伤。然后你脑海里将会不断出现这些话，这时候，最坏的情况就会出现，就是你会失去自我判断的能力，而当你明白「你是个怎样的人，并不是由那些不了解你，不关心你的人来决定」的时候，你就释然了。\n她的一席话像是一抹清泉注入我心里，泛起丝丝凉意。我一直相信一个好的偶像可以照亮你前方的路，你可以从他的身上获取不竭的动力，你会想成为他那样的人！"
 },
 "specials":"",
 "defaults":""
 }
]}



